mystore_backend/app/controllers/products_controller.rb

  def index
    if current_user.admin?
      @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "price", "margin", "created_at", "updated_at", "total_sales") VALUES (?, ?, ?, ?, ?, ?)  [["name", "raji"], ["price", 14], ["margin", 21], ["created_at", "2018-08-15 11:42:27.822749"], ["updated_at", "2018-08-15 11:42:27.822749"], ["total_sales", 2]]

  def deleteproduct
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]

  def sales
    @product = Product.find(params[:id])
    @product.total_sales = @product.total_sales + 1
    @product.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "total_sales" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["total_sales", 201], ["updated_at", "2018-08-15 17:22:10.624481"], ["id", 1]]

  def updateproduct
    @product = Product.find(params[:id])
    @product.name = params[:name]
    @product.price = params[:price]
    @product.margin = params[:margin]
    @product.total_sales = params[:total_sales]
    if @product.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Product B"], ["price", 1502], ["updated_at", "2018-08-16 07:37:56.329598"], ["id", 2]]